# 3. Напишите программу, в которой пользователь будет задавать две строки,
#    программа - определять количество вхождений одной строки в другой.


str1 = input('enter text: ')
sub = input('enter substring: ')

print(str1.count(sub))